Repository: juandg/IDE_translations
Catalog: Resources_*.po
Languages: hr, vi

source: No files were added to the sketch.
hr: Niti jedna datoteka nije dodana u skicu.
vi: Không có tập tin trong bản thảo.

source: One file added to the sketch.
hr: Jedna datoteka je dodana u skicu.
vi: Đã thêm một tập tin vào bản thảo.

source: {0} files added to the sketch.
hr: {0} datoteka je dodano u skicu.
vi: {0} tập tin vừa được thêm vào bản thảo.

source: File
hr: Datoteka
vi: Tập tin

source: New
hr: Novo
vi: Tạo mới

source: Open...
hr: Otvori...
vi: Mở...

source: Sketchbook
hr: Blok sa skicama
vi: Tập bản thảo

source: Examples
hr: Primjeri
vi: Bài mẫu

source: Close
hr: Zatvori
vi: Đóng

source: Save
hr: Snimi
vi: Lưu

source: Save As...
hr: Snimi kao
vi: Lưu khác...

source: Upload
hr: Prenesi
vi: Tải lên bo

source: Upload Using Programmer
hr: Prenesi koristeći programator
vi: Tải lên bo dùng mạch nạp

source: Page Setup
hr: Postavke stranice
vi: Thiết lập trang

source: Print
hr: Ispis
vi: In

source: Preferences
hr: Postavke
vi: Tùy chỉnh

source: Quit
hr: Izađi
vi: Thoát

source: Sketch
hr: Skica
vi: Bản thảo

source: Verify / Compile
hr: Provjeri / Kompajliraj
vi: Xác minh / Biên dịch

source: Import Library...
hr: Uključi biblioteku...
vi: Thêm thư viện...

source: Show Sketch Folder
hr: Prikaži mapu sa skicama
vi: Xem thư mục chứa bản thảo

source: Add File...
hr: Dodaj datoteku...
vi: Thêm tập tin...

source: Tools
hr: Alati
vi: Công cụ

source: Serial Monitor
hr: Monitor serijskog prometa
vi: Giao tiếp nối tiếp

source: Board
hr: Modul
vi: Bo mạch

source: Serial Port
hr: Serijski port
vi: Cổng nối tiếp

source: Programmer
hr: Programator
vi: Mạch nạp

source: Burn Bootloader
hr: Zapiši Bootloader
vi: Nạp chương trình khởi động

source: serialMenu is null
hr: serialMenu je null
vi: Không có cổng nối tiếp nào

source: name is null
hr: name je null
vi: Không có tên

source: error retrieving port list
hr: Greška pri pronalasku portova
vi: Lỗi khi truy xuất danh sách các cổng

source: Help
hr: Pomoć
vi: Giúp đỡ

source: Getting Started
hr: Započnite s radom
vi: Bài khởi động

source: Environment
hr: Okolina
vi: Môi trường

source: Troubleshooting
hr: Pronalaženje problema
vi: Xử lí sự cố

source: Reference
hr: Poveznica
vi: Tham khảo

source: Find in Reference
hr: Pronađi u poveznicama
vi: Tìm trong tài liệu tham khảo

source: Frequently Asked Questions
hr: Učestalo postavljana pitanja
vi: Những câu hỏi thường gặp

source: Visit Arduino.cc
hr: Pogledajte Arduino.cc
vi: Tới trang Arduino.cc

source: About Arduino
hr: O Arduino-u
vi: Thông tin về Arduino

source: Edit
hr: Uredi
vi: Biên tập

source: Undo
hr: Vrati nazad
vi: Bỏ tác vụ

source: Redo
hr: Vrati naprijed
vi: Làm lại tác vụ

source: Cut
hr: Izreži
vi: Cắt

source: Copy
hr: Kopiraj
vi: Sao chép

source: Copy for Forum
hr: Kopiraj iz Forum-a
vi: Cắt cho vào forum

source: Copy as HTML
hr: Kopiraj kao HTML
vi: Sao chép dưới dạng HTML

source: Paste
hr: Dodaj kopirano
vi: Dán

source: Select All
hr: Označi sve
vi: Chọn tất cả

source: Comment/Uncomment
hr: Komentiraj/odkomentiraj
vi: Chú thích/Không chú thích

source: Increase Indent
hr: Povečaj poravnanje
vi: Tăng thụt lề

source: Decrease Indent
hr: Smanji poravnanje
vi: Giảm thụt lề

source: Find...
hr: Pronađi...
vi: Tìm kiếm...

source: Find Next
hr: Pronađi slijedeće
vi: Tìm tiếp

source: Find Previous
hr: Pronađi prethodno
vi: Tìm về trước

source: Use Selection For Find
hr: Upotrijebi označeno za pronalaženje
vi: Sử dụng Sự lựa chọn cho tìm kiếm

source: First select a word to find in the reference.
hr: Potrebno je odabrati riječ da bi se pretražile postavke.
vi: Đầu tiên chọn một từ để tìm trong mục tham khảo.

source: No reference available for "{0}"
hr: Nema postavki za "{0}"
vi: Không có tham khảo cho "{0}"

source: Compiling sketch...
hr: Kompajliranje skice...
vi: Đang biên dịch bản thảo...

source: Done compiling.
hr: Kompajliranje završeno.
vi: Biên dịch xong.

source: Save changes to "{0}"?
hr: Snimi promjene u "{0}"?
vi: Lưu sự thay đổi tới "{0}"?

source: <html> <head> <style type="text/css">b { font: 13pt "Lucida Grande" }p { font: 11pt "Lucida Grande"; margin-top: 8px }</style> </head><b>Do you want to save changes to this sketch<BR> before closing?</b><p>If you don't save, your changes will be lost.
hr: <html> <head> <style type="text/css">b { font: 13pt "Lucida Grande" }p { font: 11pt "Lucida Grande"; margin-top: 8px }</style> </head><b>Želite li snimiti promjene skice<BR> prije zatvaranja?</b><p>Ako se promjene ne snime, biti će izgubljene.
vi: <html> <head> <style type="text/css">b { font: 13pt "Lucida Grande" }p { font: 11pt "Lucida Grande"; margin-top: 8px }</style> </head><b>Bạn có muốn lưu sự thay đổi tới bản thảo này<BR> trước khi đóng lại?</b><p>Nếu bạn không lưu, sự thay đổi sẽ mất.

source: Cancel
hr: Odustani
vi: Hủy bỏ

source: Don't Save
hr: Nemoj zapisati
vi: Không lưu

source: Bad file selected
hr: Loše odabrana datoteka
vi: Tập tin được chọn không tốt

source: Processing can only open its own sketches and other files ending in .ino or .pde
hr: Processing može otvoriti samo svoje skice i druge datoteke čiji nastavak je .ino ili .pde
vi: Chương trình chỉ có thể mở bản thảo của chính nó và các tập tin với đuôi là .ino hoặc .pde

source: OK
hr: Prihvati
vi: Chấp nhận

source: The file "{0}" needs to be inside a sketch folder named "{1}". Create this folder, move the file, and continue?
hr: Datoteka "{0}" treba biti unutar\ mape "{1}" za skice. Kreiraj mapu, pomakni datoteku i nastavi?
vi: Tập tin "{0}" cần phải ở trong một tập thư mục bản thảo có tên là "{1}". Tạo thư mục này, di chuyển tập tin, và tiếp tục?

source: Moving
hr: Pomicanje
vi: Đang di chuyển

source: Error
hr: Pogreška
vi: Lỗi

source: A folder named "{0}" already exists. Can't open sketch.
hr: Mapa s imenom "{0}" već postoji. Nemogućnost otvaranja skice.
vi: Thư mục tên là "{0}" đã tồn tại. Không thể mở bản thảo.

source: Could not create the sketch folder.
hr: Nemogućnost kreiranje mape s skicama
vi: Không thể tạo thư mục chứa các bản thảo.

source: Could not copy to a proper location.
hr: Nemogućnost kopiranja na zadanu lokaciju.
vi: Không thể sao chép tới một địa chỉ riêng.

source: Could not create the sketch.
hr: Nemogućnost kreiranja skice.
vi: Không thể tạo bản thảo.

source: Saving...
hr: Pohranjivanje...
vi: Đang lưu...

source: Done Saving.
hr: Pohranjivanje završilo
vi: Đã lưu xong.

source: Save Canceled.
hr: Snimi odustano.
vi: Hủy bỏ tác vụ lưu trữ.

source: Serial port {0} not found. Retry the upload with another serial port?
hr: Serijski port {0} nije pronađen Možemo pokušati prijenos s drugim serijskim portom?
vi: cổng nối tiếp số {0} không tìm thấy. Thử tải lên với một cổng khác?

source: Uploading to I/O Board...
hr: Prenošenje na I/O modul
vi: Nạp chương trình lên mạch I/O...

source: Done uploading.
hr: Završeno prenošenje.
vi: Đã nạp xong.

source: Upload canceled.
hr: Prenošenje prekinuto.
vi: Việc nạp đã bị hủy.

source: Save changes before export?
hr: Pohrana promjena prije izvoza?
vi: Lưu những sự thay đổi trước khi xuất?

source: Export canceled, changes must first be saved.
hr: Izvoz prekinut, promjene prvo moraju biti pohranjene.
vi: Hủy xuất tập tin, sự thay đổi cần được lưu trước.

source: Burning bootloader to I/O Board (this may take a minute)...
hr: Zapisivanje bootloadera na I/O modul (ovo može potrajati nekoliko minuta)...
vi: Đang nạp chương trình khởi động cho mạch I/O (Có thễ mất vài phút)...

source: Done burning bootloader.
hr: Završeno zapisivanje bootloader-a.
vi: Đã nạp chương trình khởi động xong.

source: Error while burning bootloader.
hr: Greška prilikom zapisivanja bootloader-a.
vi: Có lỗi khi đang nạp chương trình khởi động.

source: Printing...
hr: Ispis...
vi: Đang in...

source: Done printing.
hr: Završen ispis.
vi: Đã in xong.

source: Error while printing.
hr: Greška prilikom ispisa.
vi: Lỗi khi đang in.

source: Printing canceled.
hr: Ispis prekinut.
vi: Hủy lệnh in.

source: Bad error line: {0}
hr: Greška u liniji: {0}
vi: Có lỗi ở dòng: {0}

source: Open URL
hr: Otvori URL
vi: Mở đường dẫn URL

source: A new version of Arduino is available, would you like to visit the Arduino download page?
hr: Dostupna je nova verzija Arduina, želite li posjetiti Arduino stranicu za dohvat ?
vi: Phiên bản mới của Arduino hiện có sẵn, Bạn có muốn tới trang của Arduino để tải về?

source: Yes
hr: Da
vi: Đồng ý

source: No
hr: Ne
vi: Từ chối

source: Update
hr: Ažuriranje
vi: Nâng cấp

source: Find:
hr: Traži:
vi: Tìm kiếm:

source: Replace with:
hr: Zamjeni sa:
vi: Thay bằng:

source: Ignore Case
hr: Ignoriraj velika slova
vi: Trường hợp bỏ qua

source: Wrap Around
hr: Zaokreni
vi: Cuốn vòng quanh

source: Replace All
hr: Zamjeni sve
vi: Thay thế tất cả

source: Replace
hr: Zamjeni
vi: Thay thế

source: Replace & Find
hr: Pronađi i zamjeni
vi: Thay thế và tìm kiếm

source: Previous
hr: Prije
vi: Về trước

source: Find
hr: Traži
vi: Tìm kiếm

source: Send
hr: Pošalji
vi: Gửi

source: Autoscroll
hr: Automatsko pomicanje
vi: Tự động cuốn

source: No line ending
hr: Bez znaka kraja linije
vi: Không có dòng kết thúc

source: Newline
hr: Newline (NL)
vi: Dòng mới

source: Carriage return
hr: Carriage return (CR)
vi: Xuống dòng

source: Both NL & CR
hr: Oboje NL i CR
vi: Cả hai NL & CR

source: Serial port ''{0}'' already in use. Try quitting any programs that may be using it.
hr: Serijski port ''{0}'' je u uporabi. Zatvorite sve programe koji bi ga mogli koristiti.
vi: Cổng nối tiếp ''{0}'' đang đượuc sử dụng. Tắt một số chương trình có thể đang sử dụng nó.

source: Error touching serial port ''{0}''.
hr: Greška pri korištenju serijskog porta ''{0}''.
vi: Lỗi giao tiếp với cổng nối tiếp ''{0}''.

source: Serial port ''{0}'' already in use. Try quiting any programs that may be using it.
hr: Serijski port ''{0}'' je u uporabi. Pokušajte ugasiti sve programe koji bi ga mogli koristiti.
vi: Cổng nối tiếp ''{0}'' đang được sử dụng. Tắt một số chương trình có thể đang sử dụng nó.

source: Error opening serial port ''{0}''.
hr: Greška pri otvaranju serijskog porta "{0}".
vi: Lỗi mở cổng nối tiếp ''{0}''.

source: Serial port ''{0}'' not found. Did you select the right one from the Tools > Serial Port menu?
hr: Serijski port "{0}" nije pronađen. Da li ste odabrali ispravan port u izborniku Alati>Serijski port
vi: Không tìm thấy cổng nối tiếp ''{0}''. Bạn có chọn đúng cỗng nối tiếp trong Công cụ> Danh sách cổng nối tiếp?

source: readBytesUntil() byte buffer is too small for the {0} bytes up to and including char {1}
hr: readBytesUntil() memorijski spremnik je premalen za {0} bajtova uključujći i znak {1}
vi: Bộ đệm byte của readBytesUntil() quá nhỏ cho bytes {0} đến char {1}

source: Error inside Serial.{0}()
hr: Greška u Serial.{0}()
vi: Lỗi trong cổng nối tiếp.{0}()

source: Auto Format
hr: Automatsko formatiranje
vi: Định dạng tự động

source: No changes necessary for Auto Format.
hr: Nisu potrebne izmjene za auto-formatiranje.
vi: Chưa có sự thay đổi cần thiết nào cho định dạng tự động.

source: Auto Format Canceled: Too many right parentheses.
hr: Auto-formatiranje prekinuto: Previše desnih zagrada.
vi: Hủy định dạng tự động vì: có quá nhiều dấu ngoặc phải.

source: Auto Format Canceled: Too many left parentheses.
hr: Auto-formatiranje prekinuto: Previše lijevih zagrada.
vi: Hủy định dạng tự động vì: có quá nhiều dấu ngoặc trái.

source: Auto Format Canceled: Too many right curly braces.
hr: Auto-formatiranje prekinuto: Previše desnih vitičastih zagrada.
vi: Hủy định dạng tự động vì: có quá nhiều dấu ngoặc nhọn phải.

source: Auto Format Canceled: Too many left curly braces.
hr: Auto-formatiranje prekinuto: Previše lijevih vitičastih zagrada.
vi: Hủy định dạng tự động vì: có quá nhiều dấu ngoặc nhọn trái.

source: Auto Format finished.
hr: Auto-formatiranje završeno.
vi: Hoàn thành định dạng tự động.

source: Fix Encoding & Reload
hr: Ispraviti enkoding i ponovno pokrenuti.
vi: Sửa lỗi mã hóa và tải lại

source: Discard all changes and reload sketch?
hr: Odbaciti sve promjene i ponovno učitati skicu?
vi: Bỏ hết tất cả thay đổi và tải lại?

source: An error occurred while trying to fix the file encoding. Do not attempt to save this sketch as it may overwrite the old version. Use Open to re-open the sketch and try again.
hr: Nastupila je greška u postupku popravka enkodinga. Ne pokušavajte snimiti skicu, jer će prepisati orginal. Potrebno upotrijebiti Otvori za ponovno učitanje skice.
vi: Một lỗi xảy ra khi sửa tập tin mã hóa Đừng cố lưu bản thảo này khi mà nó có thể viết đè lên bản cũ. Sử dụng Mở để mở lại bản thảo và thử lại

source: Archive Sketch
hr: Pohrani skicu
vi: Lưu trữ bản thảo

source: Couldn't archive sketch
hr: Nemoguće pohraniti skicu
vi: Không thể lưu trữ tài liệu

source: Archiving the sketch has been canceled because the sketch couldn't save properly.
hr: Prekinuto spremanje skice jer nije uspiješno pohranjena na disk.
vi: Lưu trữ bản thảo bị hủy vì bản thảo không thể lưu hợp lệ.

source: Archive sketch as:
hr: Pohrani skicu kao:
vi: Lưu trữ bản thảo với tên:

source: Archive sketch canceled.
hr: Prekinuto pohranjivanje skice.
vi: Lưu trữ bản thảo bị hủy bỏ.

source: Error while loading code {0}
hr: Greška pri učitanju kod {0}
vi: Lỗi xảy ra khi đang tải code {0}

source: "{0}" contains unrecognized characters.If this code was created with an older version of Processing,you may need to use Tools -> Fix Encoding & Reload to updatethe sketch to use UTF-8 encoding. If not, you may need todelete the bad characters to get rid of this warning.
hr: "{0}" sadrži neprepoznatljive znakove. Ako je ovaj kod napravljen s starijom verzijom Processing-a, tada je potrebno iskoristiti Alati > Ispraviti enkoding i nakon toga ponovno učitatiskicu kako bi koristila UTF-8 enkoding. U drugom slučaju potrebno je obrisati neprepoznate znakove, kako bi se izbijegla ova upozorenje.
vi: "{0}" chứa những kí tự không nhận ra. Nếu bộ code này được tạo bởi một phiên bản cũ của Processing, bạn có thể cần phải sử dụng Công cụ -> Sửa lỗi mã hóa & Tải lại để nâng cấp bản thảo với chuẩn mã hóa UTF-8. Nếu không, bạn cần phải xóa những kí tự không đúng để tránh lời cảnh báo này.

source: Sketch is Read-Only
hr: Skicu je moguće samo čitati
vi: Bản thảo chỉ đọc

source: Some files are marked "read-only", so you'll need to re-save the sketch in another location, and try again.
hr: Neke datoteke su označene kao "samo za čitanje", te je potrebno ponovno pohraniti skicu na drugu lokaciju, i pokušati ponovno.
vi: Một vài tập tin được đánh dấu "chỉ đọc", bởi vậy nên bạn cần lưu lại bản thảo ở một nơi khác, và thử lại.

source: Name for new file:
hr: Naziv nove datoteke:
vi: Tên cho tập tin mới:

source: Sketch is Untitled
hr: Skica nema naziv
vi: Bản thảo không có tiêu đề

source: How about saving the sketch first before trying to rename it?
hr: Želite li prvo pohraniti skicu pa onda preimenovati?
vi: Bản thảo của bạn sẽ được lưu lại trước khi thay đổi tên của nó?

source: Problem with rename
hr: Problem s preimenovanjem
vi: Việc đổi tên có vấn đề

source: The name cannot start with a period.
hr: Naziv nemože početi s točkom.
vi: Tên không thể bắt đầu với dấu chấm câu.

source: ".{0}" is not a valid extension.
hr: ".{0}" nije dozvoljen nastavak.
vi: ".{0}" không phải là một phần mở rộng hợp lệ.

source: The main file can't use an extension. (It may be time for your to graduate to a "real" programming environment)
hr: Osnovna datoteka nemože koristiti dodatke. (Možda je vrijeme za prelazak u stvarno programsko okruženje)
vi: Tập tin chính không thể sử dụng phần mở rộng. (Nó có thể tốn thời gian cho bạn để nâng cấp đến một môi trường lập trình "real")

source: Nope
hr: Ništa
vi: Không

source: A file named "{0}" already exists in "{1}"
hr: Datoteka "{0}" već postoji u "{1}"
vi: Tập tin tên "{0}" đã tồn tại trong "{1}"

source: You can't have a .cpp file with the same name as the sketch.
hr: Nemoguće je imati .cpp datoteku istog naziva kao i skica.
vi: Bạn không thể có tập tin có đuôi .cpp với tên trùng với bản thảo.

source: You can't rename the sketch to "{0}" because the sketch already has a .cpp file with that name.
hr: Nemoguće je preimenovati skicu "{0}" jer skica već ima .cpp datoteku istog naziva
vi: Bạn không thể thay đổi tên bản thảo thành "{0}" vì bản thảo đã có một tập tin cùng tên có đuôi .cpp.

source: Cannot Rename
hr: Nemogu preimenovati
vi: Không thể thay đổi tên

source: Sorry, a sketch (or folder) named "{0}" already exists.
hr: Skica (ili mapa) imenom "{0}" već postoji.
vi: Xin lỗi, đã tồn tại một bản thảo (hoặc thư mục) với tên "{0}".

source: Could not rename the sketch. (0)
hr: Nemogućnost preimwnovanja skice. (0)
vi: Không thể thay đổi tên của bản thảo. (0)

source: Could not rename "{0}" to "{1}"
hr: Nemoguće preimenovat "{0}" u "{1}"
vi: Không thể thay đổi tên từ "{0}" thành "{1}"

source: Could not rename the sketch. (1)
hr: Nemogućnost preimwnovanja skice. (1)
vi: Không thể thay đổi tên của bản thảo. (1)

source: Could not rename the sketch. (2)
hr: Nemogućnost preimwnovanja skice. (2)
vi: Không thể thay đổi tên của bản thảo. (2)

source: createNewFile() returned false
hr: createNewFile() vrača grešku
vi: createNewFile() trả về sai

source: Are you sure you want to delete this sketch?
hr: Da li ste sigurni da želite opbrisati ovu skicu?
vi: Bạn có chắc muốn xóa bản thảo này?

source: Are you sure you want to delete "{0}"?
hr: Da li ste sigurni da želite obrisati "{0}"?
vi: Bạn có chắc muốn xóa "{0}"?

source: Delete
hr: Brisanje
vi: Xóa

source: Couldn't do it
hr: Nemogu to napraviti
vi: Không thể làm điều này

source: Could not delete "{0}".
hr: Nemogu obrisati "{0}".
vi: Không thể xóa "{0}".

source: removeCode: internal error.. could not find code
hr: removeCode: interna greška .. nemogu naći kod
vi: removeCode: lỗi nội bộ.. không thể tìm thấy code

source: Sketch is read-only
hr: Skicu je moguće samo čitati
vi: Bản thảo là chỉ-đọc

source: Some files are marked "read-only", so you'll need to re-save this sketch to another location.
hr: Neke datoteke su označene "samo za čitanje", te je potrebno skicu snimiti na drugu lokaciju.
vi: Một vài tập tin được đánh dấu "chỉ-đọc", bạn cần phải lưu bản thảo này tới một nơi khác.

source: In Arduino 1.0, the default file extension has changed from .pde to .ino. New sketches (including those created by "Save-As" will use the new extension. The extension of existing sketches will be updated on save, but you can disable this in the Preferences dialog. Save sketch and update its extension?
hr: U Arduino 1.0 predefinirani nastavak za datoteke je promjenjen iz .pde u .ino. Nove skice (uključujući one Spremi kao) koristit će novi nastavak. Nastavak postojećih skica biti će promjenje prilikom prvog odabira Spremi, ali ovaj način rada je moguće onemogućiti u Postavkama. Spremi skicu i promjeni joj nastavak?
vi: Trong Arduino 1.0, phần mở rộng mặc định của tập tin đã thay đổi từ .pde thành .ino. Bản thảo mới (bao gồm cả những cái được tạo bởi "Lưu thành.." cũng sẽ sử dụng phần mở rộng mới này. Phần mở rộng của những bản thảo đã có sẽ được nâng cấp khi lưu, nhưng bạn có thể tắt chức năng này trong bảng Tùy chỉnh Lưu bản thảo và nâng cấp phần mở rộng của nó?

source: Save sketch folder as...
hr: Pohrani folder s skicom kao...
vi: Lưu thư mục của bản thảo thành...

source: You can't save the sketch as "{0}" because the sketch already has a .cpp file with that name.
hr: Nemoguće snimiti skicu kao "{0}" zato što skica već ima .cpp datoteku istog naziva.
vi: Bạn không thể lưu bản thảo thành "{0}" vì tên đó đã được dùng cho một tập tin .cpp trong cùng bản thảo.

source: How very Borges of you
hr: Kako lijepo od vas
vi: Kì quá

source: You cannot save the sketch into a folder inside itself. This would go on forever.
hr: Nemoguće snimiti skicu u mapu unutar nje same.
vi: Bạn không thể lưu bản thảo trong một thư mục chứa chính nó. Điều này có thể gây lặp vô tận .

source: Select an image or other data file to copy to your sketch
hr: Odaberite binarnu sliku ili drugu datoteku za kopiranje u aktualnu skicu
vi: Chọn một hình ảnh hoặc tập tin dữ liệu khác vào bản thảo của bạn

source: Replace the existing version of {0}?
hr: Zamjeniti će se postojeća verzija {0}?
vi: Thay thế phiên bản hiện tại của {0}?

source: Error adding file
hr: Greška pri dodavanju datoteke
vi: Lỗi thêm tập tin

source: Could not delete the existing ''{0}'' file.
hr: Nemoguće obrisati postojeću datoteku "{0}".
vi: Không thể cóa tập tin hiện hành ''{0}''.

source: You can't fool me
hr: Nemožeš me prevariti
vi: Xin đừng lừa em ^^

source: This file has already been copied to the location from which where you're trying to add it. I ain't not doin nuthin'.
hr: Ova datoteke je već kopirana na lokaciju na koju se pokušava dodati.
vi: Tập tin này đã được sao chép đến nơi mà bạn đang cố gắng thêm vào. Tôi không làm gì nhé.

source: Could not add ''{0}'' to the sketch.
hr: Nemogu dodati {0} u skicu.
vi: Không thể thêm ''{0}'' vào bản thảo.

source: Build folder disappeared or could not be written
hr: Radna mapa je nestala ili se u nju nemože pisati
vi: Thư mục làm việc không còn hoặc không thể viết lên

source: Could not find main class
hr: Nemogu pronači main klasu
vi: Không thể tìm lớp chính

source: Uncaught exception type: {0}
hr: Nedefinirani tip izuzetka: {0}
vi: Không nhận ra ngoại lệ này: {0}

source: Problem moving {0} to the build folder
hr: Problem prilikom pomicanja {0} u radnu mapu
vi: Có vấn đề khi di chuyển {0} tới thư mục làm việc

source: Uploading...
hr: Prenosim...
vi: Đang tải lên...

source: Binary sketch size: {0} bytes (of a {1} byte maximum)
hr: Binarna veličina skice: {0} bajtova (od maksimalno {1} bajtova)
vi: Kích thước nhị phân của bản thảo là: {0} bytes (tối đa là {1} bytes)

source: Couldn't determine program size: {0}
hr: Nemoguće odrediti veličinu programa : {0}
vi: Không thể xác định kích thước của chương trình: {0}

source: Sketch too big; see http://www.arduino.cc/en/Guide/Troubleshooting#size for tips on reducing it.
hr: Skica je prevelika, vidi http://www.arduino.cc/en/Guide/Troubleshooting#size za preporuke o veličini.
vi: Bản thảo quá lớn; xem http://www.arduino.cc/en/Guide/Troubleshooting#size để biết thêm những chỉ dẫn giảm bớt chương trình.

source: Missing the */ from the end of a /* comment */
hr: Nedostaje */ na kraju od /* komentar */
vi: Thiếu dấu */ ở cuối cúa cặp lệnh /* chú thích */

source: Sketch Disappeared
hr: Skica je nestala
vi: Bản thảo biến mất

source: The sketch folder has disappeared. Will attempt to re-save in the same location, but anything besides the code will be lost.
hr: Mapa s skicama je nestala. Programska podrška će pokušati ponovno spremanje na isto mjesto, ali sve izvan koda skice će biti izgubljeno.
vi: Thư mục chứa bản thảo đã biến mất. Chương trình sẽ lưu lại tại cùng địa chỉ, nhưng mọi thứ ngoài code sẽ bị mất.

source: Could not re-save sketch
hr: Nemoguće ponovno zapisivanje skice.
vi: Không thể lưu bản thảo lại

source: Could not properly re-save the sketch. You may be in trouble at this point, and it might be time to copy and paste your code to another text editor.
hr: Nemoguće ispravno ponovno zapisivanje skice. Iskopirajte kompletan tekst u neki drugi text editor, kako bi ste sačuvali uneseno.
vi: Không thể lưu bản thảo lại một cách chính xác. Bạn có thể gặp vấn đề từ đây, và có thể mất một ít thời gian để sao chép và dán code của bạn tới một soạn thảo khác.

source: The sketch name had to be modified. Sketch names can only consist of ASCII characters and numbers (but cannot start with a number). They should also be less less than 64 characters long.
hr: Naziv skice je potrebno promjeniti. Naziv skice smije sadržavati ASCII slova i brojeve (ali nesmije početi s brojem). Naziv bi trebao biti puno kraći od maximalnih 64 znaka.
vi: Tên của bản thảo đã bị sửa đổi. Tên của bản thảo chỉ có thể chứa kí tự ASCII và số (tuy nhiên không được bắt đầu bằng số). Tên của bản thảo nên ngắn hơn 64 kí tự.
