Repository: juandg/IDE_translations
Catalog: Resources_*.po
Languages: hr, vi

source: Forcing reset using 1200bps open/close on port
hr: Prisilni reset korištenjem 1200bps otvori/zatvori postuupka na portu
vi: Bắt buộc khởi động lại bởi đóng / mở cổng với tốc độ 1200bps

source: Couldn’t find a Leonardo on the selected port. Check that you have the correct port selected. If it is correct, try pressing the board's reset button after initiating the upload.
hr: Nemogu pronaći Leonardo-a na odabranom portu. Provjerite jeste li ispravno odabrali port. Ako je port ispravan, pritisnite tipku reset na modulu, nakon osnovnog prijenosa.
vi: Không thể tìm thấy Leonardo trên cổng đã chọn. Hãy kiểm tra rằng bạn đã chọn đúng cổng. Nếu đã chọn đúng, thử nhấn nút khởi động lại bo mạch của bạn sau khi thiết lập để tải lên.

source: Compiler error, please submit this code to {0}
hr: Pogreška pri kompajliranju, molim pošaljite kod {0}
vi: Lỗi biên dịch, xin hảy gửi đoạn code này tới {0}

source: the selected serial port {0} does not exist or your board is not connected
hr: odabrani serijski port {0} ne postoji ili vaš modul nije spojen
vi: Cổng nối tiếp được chọn {0} không tồn tại hoặc bo mạch của bạn chưa được kết nối

source: Device is not responding, check the right serial port is selected or RESET the board right before exporting
hr: Uređaj ne odgovara, provjerite odgovarajući serijski port ili tipkom RESET resetirajte modul prije prijenosa.
vi: Thiết bị không phản hồi, kiểm tra xem đã đúng cổng nối tiếp được chọn chưa hoặc khởi động lại bo mạch ngay trước khi xuất khẩu

source: Problem uploading to board. See http://www.arduino.cc/en/Guide/Troubleshooting#upload for suggestions.
hr: Problem pri prijenosu na modul. Vidi http://www.arduino.cc/en/Guide/Troubleshooting#upload za pomoć.
vi: Gặp vấn đề khi tải xuống bo. Xem http://www.arduino.cc/en/Guide/Troubleshooting#upload để có nững lời khuyên về trường hợp này.

source: Wrong microcontroller found. Did you select the right board from the Tools > Board menu?
hr: Pronađen pogrešan mikro-kontroler. Da li ste odabrali dobar modul u izborniku Alati > Modul
vi: Tìm thấy chip vi điều khiển không đúng. Bạn đã chọn đúng loại bo từ mục Công cụ> Danh sách bo ?

source: No board selected; please choose a board from the Tools > Board menu.
hr: Nije odabran niti jedan modul, molimo odaberite modul iz izbornika Alati > Modul.
vi: Chưa chọn bo mạch; xin hãy chọn một bo từ Công cụ > Danh sách bo.

source: {0} returned {1}
hr: {0} vraća {1}
vi: {0} trả về {1}

source: Error compiling.
hr: Pogreška pri kompiliranju
vi: Lỗi biên dịch.

source: Please import the SPI library from the Sketch > Import Library menu.
hr: Uključite SPI biblioteku iz izbornika Skica > Ukljući
vi: Xin hãy nhập thêm thư viện SPI từ Bản thảo > Nhập từ danh sách thư viện.

source: As of Arduino 0019, the Ethernet library depends on the SPI library. You appear to be using it or another library that depends on the SPI library.
hr: Od Arduino 0019, Ethernet bibliotekaovisi o SPI datoteci. Koristi se ta ili neka druga biblioteka koja treba SPI biblioteku
vi: Từ phiên bản 0019, thư viện cho Ethernet phục thuộc vào thư viện SPI. Bạn có vẻ đang sử dụng nó hoặc thư viện khác mà có phụ thuộc vào thư viện SPI.

source: The 'BYTE' keyword is no longer supported.
hr: 'BYTE' ključna riječ nije više podržana.
vi: Từ khóa 'BYTE' không còn dùng được nữa.

source: As of Arduino 1.0, the 'BYTE' keyword is no longer supported. Please use Serial.write() instead.
hr: Od Arduino 1.0, 'BYTE' ključna riječ nije više podržana. Potrebno je koristiti Serial.write() umjesto nje.
vi: Trong Arduino 1.0, từ khóa 'BYTE' không còn được sử dụng. Xin hãy sử dụng hàm Serial.write() để thay thế.

source: The Server class has been renamed EthernetServer.
hr: Server klasa je preimenovana u EthernetServer.
vi: Lớp Server đã được đổi tên thành EthernetServer.

source: As of Arduino 1.0, the Server class in the Ethernet library has been renamed to EthernetServer.
hr: Od Arduino 1.0, Server klasa u Ethernet biblioteci je preimenovana u EthernetServer.
vi: Trong Arduino 1.0, lớp Server trong thư viện Ethernet đã được đổi tên thành EthernetServer.

source: The Client class has been renamed EthernetClient.
hr: Client klas je preimenovana u EthernetClient.
vi: Lớp Client đã được đổi tên thành EthernetClient.

source: As of Arduino 1.0, the Client class in the Ethernet library has been renamed to EthernetClient.
hr: Od Arduino 1.0, Client klasa u Ethernet biblioteci je preimenovana u EthernetClient.
vi: Trong Arduino 1.0, lớp Client trong thư viện Ethernet đã được đổi tên thành EthernetClient.

source: The Udp class has been renamed EthernetUdp.
hr: Udp klasa je preimenovana u EthernetUdp.
vi: Lớp Udp đã được đổi tên thành EthernetUdp.

source: Wire.send() has been renamed Wire.write().
hr: Wire.send() je preimenovan Wire.write().
vi: Wire.send() được đổi tên thành Wire.write().

source: As of Arduino 1.0, the Wire.send() function was renamed to Wire.write() for consistency with other libraries.
hr: Od Arduino 1.0, Wire.send() funkcija je preimenovana u Wire.write() kao bi se postigla ujednačenost s ostalim bibliotekama.
vi: Trong Arduino 1.0, hàm Wire.send() được đổi tên thành Wire.write() để nhất quán với các thư viện khác.

source: Wire.receive() has been renamed Wire.read().
hr: Wire.receive() je preimenovan Wire.read().
vi: Wire.receive() được đổi tên thành Wire.read().

source: As of Arduino 1.0, the Wire.receive() function was renamed to Wire.read() for consistency with other libraries.
hr: Od Arduino 1.0, Wire.receive() funkcija je preimenovana u Wire.read() kao bi se postigla ujednačenost s ostalim bibliotekama.
vi: Trong Arduino 1.0, hàm Wire.receive() được đổi tên thành Wire.read() để nhất quán với các thư viện khác.

source: 'Mouse' only supported on the Arduino Leonardo
hr: 'Miš' je podržan samo na Arduino Leonardo-u
vi: 'Mouse' chỉ được dùng trong Arduino Leonardo

source: 'Keyboard' only supported on the Arduino Leonardo
hr: 'Tipkovnica' je podržana samo na Arduino Leonardo-u
vi: 'Keyboard' chỉ được dùng trong Arduino Leonardo

source: Console Error
hr: Greška konzole
vi: Lỗi giao diện điều khiển

source: A problem occurred while trying to open the files used to store the console output.
hr: Nastao je problem pri otvaranju datoteke za pohranu ispisa s konzole.
vi: Lỗi xảy ra khi mở những tập tin dùng để chứa tín hiệu xuất ra từ giao diện điều khiển.

source: Non-fatal error while setting the Look & Feel.
hr: Ne kritične greške prilikom postavljanja grafičkog izgleda.
vi: Lỗi không nguy hiểm xảy ra khi thiết lập Nhìn & Cảm nhận.

source: The error message follows, however Arduino should run fine.
hr: Pronađene su greške, ali Arduino radi uredno.
vi: Có thông báo lỗi, tuy nhiên Arduino vẫn có thể chạy tốt.

source: Problem Setting the Platform
hr: Problem pri određivanju platforme
vi: Thiết lập Nền có vấn đề

source: An unknown error occurred while trying to load platform-specific code for your machine.
hr: Pojavila se nepoznata greška prilikom pokretanja specifičnog koda za vaše računalo.
vi: Một lỗi lạ xuất hiện khi tải đoạn mã đặc tả nền lên máy bạn.

source: Please install JDK 1.5 or later
hr: Instalirajte JDK 1.5 ili noviju verziju
vi: Xin hãy cài đặt JDK 1.5 hoặc hơn nữa

source: Arduino requires a full JDK (not just a JRE) to run. Please install JDK 1.5 or later. More information can be found in the reference.
hr: Arduino treba kompletni JDK , a ne samo JRE, da bi radio. Molim instalirajte JDK 1.5 ili noviju verziju. VIše o ovome moguće je pronaći u dokumentaciji.
vi: Arduino cần đầy đủ JDK (không chỉ JRE) để chạy. Xin hãy cài đặt JDK 1.5 hoặc hơn nữa. Thông tin thêm có thể tìm thấy trong mục tham khảo.

source: Sketchbook folder disappeared
hr: Nestala mapa s blokom sa skicama
vi: Thư mục tập bản thảo biến mất

source: The sketchbook folder no longer exists. Arduino will switch to the default sketchbook location, and create a new sketchbook folder if necessary. Arduino will then stop talking about himself in the third person.
hr: Mapa s blokom sa skicama više ne postoji. Arduino će koristiti predefinirani poziciju za blokom sa skicama, te po potrebi kreirati mapu na toj lokaciji. Nakon toga će Arduino prestat govoriti o samom sebi u trecem licu.
vi: Thư mục tập bản thảo đã không còn nữa. Arduino sẽ chuyển tới nơi tập bản thảo mặc định, và tạo mới một thư mục tập bản thảo mới nếu cần thiết. Arduino sẽ không cảnh báo nữa.

source: Time for a Break
hr: Vrijeme je za pauzu
vi: Giờ giải lao

source: You've reached the limit for auto naming of new sketches for the day. How about going for a walk instead?
hr: Dostigli ste današnji limit za automatsko davanje naziva novim skicama Zašto ne bi otišli u relaksirajuću šetnju?
vi: Bạn vừa chạm tới giới hạn cho điền tên tự động bản thảo mới trong một ngày. Bạn nên nghỉ một chút và đi lại cho khuây khỏa?

source: Sunshine
hr: Sunčano
vi: Ánh dương

source: No really, time for some fresh air for you.
hr: Ne, vrijeme je da udahnete malo sviježeg zraka.
vi: Hú ù, hít thở không khí trong lành thôi .

source: Open an Arduino sketch...
hr: Otvori Arduino skicu...
vi: Mở một bản thảo Arduino...

source: <html> <head> <style type="text/css">b { font: 13pt "Lucida Grande" }p { font: 11pt "Lucida Grande"; margin-top: 8px }</style> </head><b>Are you sure you want to Quit?</b><p>Closing the last open sketch will quit Arduino.
hr: <html> <head> <style type="text/css">b { font: 13pt "Lucida Grande" }p { font: 11pt "Lucida Grande"; margin-top: 8px }</style> </head><b>Da li ste sigurni da želite završiti?</b><p>Zatvaranje zadnje otvorene skice će zatvoriti Arduino.
vi: <html> <head> <style type="text/css">b { font: 13pt "Lucida Grande" }p { font: 11pt "Lucida Grande"; margin-top: 8px }</style> </head><b>Bạn có chắc muốn thoát?</b><p>Đóng bản thảo cuối cùng sẽ thoát chương trình Arduino.

source: Contributed
hr: Pridonjeli
vi: Đóng góp

source: Sketch Does Not Exist
hr: Skica ne postoji
vi: Bản thảo không tồn tại

source: The selected sketch no longer exists. You may need to restart Arduino to update the sketchbook menu.
hr: Izabrali ste skicu koja više ne postoji. Možda će trebat povno pokrenuti Arduino kako bi se obnovio blok s skicama.
vi: Bản thảo được chọn không còn tồn tại nữa. Bạn cần phải khởi động lại Arduino để nâng cấp danh sách tập bản thảo.

source: The sketch "{0}" cannot be used. Sketch names must contain only basic letters and numbers (ASCII-only with no spaces, and it cannot start with a number). To get rid of this message, remove the sketch from {1}
hr: Skica "{0}" se ne može koristiti. Ime skice smije sadržavati samo osnovna slova i brojeva. (samo ASCII, bez razmaknica, i ne smije započeti s brojem). Da bi ste zatvorili ovu poruku, obrišite skicu iz {1}
vi: Bản thảo "{0}" không dùng được. Tên của bản thảo chỉ được chứa kí tự cơ bản và số (chỉ dùng mã ASCII và không dùng khoảng trắng, không bắt đầu bằng số). Để tránh thông báo này, xóa bản thảo khỏi {1}

source: Ignoring sketch with bad name
hr: Ignoriraj skice s lošim nazivima
vi: Bỏ qua bản thảo với tên ko đúng

source: The library "{0}" cannot be used. Library names must contain only basic letters and numbers. (ASCII only and no spaces, and it cannot start with a number)
hr: Biblioteku "{0}" je nemoguće koristiti. Naziv biblioteke smije sadržavati samo osnovna slova i brojke. (ASCII slova, bez razmaka, i nesmije početi s brojem)
vi: Thư viện "{0}" không dùng được. Tên thư viện chỉ được chứa kí tự cơ bản và số. (chỉ dùng mã ASCII và không dùng khoảng trắng, không bắt đầu bằng số)

source: Ignoring bad library name
hr: Biblioteke s lošim nazivom se ignoriraju
vi: Bỏ qua thư viện với tên không đúng

source: Problem getting data folder
hr: Problem pri dohvatu Arduino mape s podacima.
vi: Lấy dữ liệu thư mục gặp vấn đề

source: Error getting the Arduino data folder.
hr: Greška pri dohvatu Arduino mape s podacima.
vi: Lỗi khi lấy dữ liệu từ thư mục dữ liệu Arduino.

source: Settings issues
hr: Problemi s postavkama
vi: Thiết lập vấn đề

source: Arduino cannot run because it could not create a folder to store your settings.
hr: Arduino nemože raditi jer nemože kreirati novu mapu za postavke.
vi: Arduino không thể chạy vì nó không thể tạo một thư mục để chứa những cấu hình của bạn.

source: You forgot your sketchbook
hr: Zaboravili ste blok sa skicama
vi: Bạn đã quên tập bản thảo

source: Arduino cannot run because it could not create a folder to store your sketchbook.
hr: Arduino nemože raditi jer nemože kreirati novu mapu za blok skica.
vi: Arduino không thể chạy vì nó khộng thể tạo một thư mục để chứa tập bản thảo của bạn.

source: Select (or create new) folder for sketches...
hr: Izaberite ili napravite novu mapu za skice
vi: Chọn (hoặc tạo mới) thư mục cho tập bản thảo...

source: Problem Opening URL
hr: Problem pri otvaranju URL-a
vi: Vấn đề khi mở đường dẫn URL

source: Could not open the URL {0}
hr: Nemogu otvoriti URL {0}
vi: Không thể mở đường dẫn URL {0}

source: Problem Opening Folder
hr: Problem s otvaranjem mape
vi: Vấn đề khi mở thư mục

source: Could not open the folder {0}
hr: Nemogu otvoriti mapu {0}
vi: Không thể mở thư mục {0}

source: environment
hr: okolina
vi: môi trường

source: Message
hr: Poruka
vi: Thông điệp

source: Warning
hr: Upozorenje
vi: Cảnh báo

source: Could not remove old version of {0}
hr: Nemogu maknuti staru verziju od {0}
vi: Không thể bỏ phiên bản cũ của {0}

source: Could not replace {0}
hr: Nemogu zamjeniti {0}
vi: Không thể thay thế {0}

source: Could not delete {0}
hr: Nemogu obrisati {0}
vi: Không thể xóa {0}

source: New Tab
hr: Nova kartica
vi: Thẻ mới

source: Rename
hr: Preimenuj
vi: Đổi tên

source: Previous Tab
hr: Prethodna kartica
vi: Thẻ trước

source: Next Tab
hr: Slijedeća kartica
vi: Thẻ kế tiếp

source: Verify
hr: Provjeri
vi: Xác minh

source: Open
hr: Otvori
vi: Mở

source: New Editor Window
hr: Novi prozor za editiranje
vi: Cửa sổ soạn thảo mới

source: Open in Another Window
hr: Otvaranje novog prozora.
vi: Mở trong một cửa sổ khác

source: No launcher available
hr: Nema aplikacije za pokretanje.
vi: Không có chương trình khởi chạy nào sẵn sàng

source: Unspecified platform, no launcher available. To enable opening URLs or folders, add a "launcher=/path/to/app" line to preferences.txt
hr: Nedefinirana platforma, nepoznat launcher. Kako bi se omogučilo pokretanje, potrebno je dodati "launcher=/path/to/app" liniju u preferences.txt datoteku
vi: Nền không xác định, không có chương trình khởi chạy nào sẵn sàng. Để cho phép mở đường dẫn URL hoặc thư mục, thêm dòng "launcher=/đường dẫn/đến/app" vào preferences.txt

source: Could not read color theme settings. You'll need to reinstall Processing.
hr: Nemoguće čitanje postavki o shemi boja. Potrebna je ponovna instalacija Processing.
vi: Không thể đọc thiết lập màu nền.Bạn sẽ phải cài lại Processing.

source: Browse
hr: Pregledavanje
vi: Đường dẫn

source: System Default
hr: Orginalne postavke
vi: Hệ thống mặc định

source: Arabic
vi: Tiếng A rập

source: Aragonese
vi: Tiếng Aragon

source: Catalan
vi: Tiếng Catalan

source: Chinese Simplified
vi: Tiếng Trung giản thể

source: Chinese Traditional
vi: Tiếng Trung truyền thống

source: Danish
vi: Tiếng Đan Mạch

source: Dutch
vi: Tiếng Hà Lan

source: English
vi: Tiếng Anh

source: Estonian
vi: Tiếng Estonia

source: Filipino
vi: Tiếng Philipin

source: French
vi: Tiếng Pháp

source: Galician
vi: Tiếng Galicia

source: German
vi: Tiếng Đức

source: Greek
vi: Tiếng Hy lạp

source: Hindi
vi: Tiếng Hindi

source: Hungarian
vi: Tiếng Hungari

source: Indonesian
vi: Tiếng Indonesia

source: Italian
vi: Tiếng Italy

source: Japanese
vi: Tiếng Nhật

source: Korean
vi: Tiếng Hàn quốc

source: Latvian
vi: Tiếng Latvia

source: Lithuaninan
vi: Tiếng Lithuania

source: Marathi
vi: Tiếng Marathi

source: Norwegian
vi: Tiếng Nauy

source: Persian
vi: Tiếng Ba tư

source: Polish
vi: Tiếng Ba lan

source: Portuguese
vi: Tiếng Bồ đào nha

source: Romanian
vi: Tiếng Romani

source: Russian
vi: Tiếng Nga

source: Spanish
vi: Tiếng Tây ban nha

source: Tamil
vi: Tiếng Ta min

source: Could not read default settings. You'll need to reinstall Arduino.
hr: Nemoguće čitanje osnovnih postavki. Potrebno je ponovno instalirati Arduino.
vi: Không thể đọc cấu hình mặc định. Bạn cần phải cài Arduino lại.

source: Could not read preferences from {0}
hr: Nemoguće čitanje postavki iz {0}
vi: Không thể đọc các tùy chỉnh từ {0}

source: Error reading preferences
hr: Greška pri čitanju postavki
vi: Lỗi khi đọc các tùy chỉnh

source: Error reading the preferences file. Please delete (or move) {0} and restart Arduino.
hr: Greška pri čitanju datoteke s postavkama. Molimo obrisati ili pomaknuti {0} i ponovno pokrenuti Arduino.
vi: Lỗi khi đọc tập tin tùy chỉnh. Xin hãy xóa (hoặc di chuyển) {0} và khởi động lại Arduino.

source: Sketchbook location:
hr: Lokacija bloka s skicama:
vi: Địa chỉ của tập bản thảo:

source: Select new sketchbook location
hr: Odaberite novu lokaciju za blok s skicama
vi: Chọn một địa chỉ mới cho tập bản thảo

source: Editor language:
hr: Jezik uređivanja:
vi: Ngôn ngữ soạn thảo:

source: (requires restart of Arduino)
hr: (potrebno ponovno pokretanje Arduino-a)
vi: (đòi hỏi khởi động lại Arduino)

source: Editor font size:
hr: Veličina fonta:
vi: Cỡ chữ soạn thảo:

source: Show verbose output during:
hr: Prikaži prošireni ispis prilikom:
vi: Xem kết quả dài trong khi:

source: compilation
hr: kompajliranje
vi: biên dịch

source: upload
hr: prijenos
vi: nạp lên bo

source: Verify code after upload
hr: Provjera koda nakon prijenosa
vi: Kiểm tra code sau khi nạp

source: Use external editor
hr: Korištenje vanjskog uređivača teksta
vi: Sử dụng chương trình soạn thảo khác

source: Check for updates on startup
hr: Provjera nadogradnji pri pokretanju
vi: Kiểm tra nâng cấp khi khởi động

source: Update sketch files to new extension on save (.pde -> .ino)
hr: Promjena nastavka iz .pde ->ino spri snimanju datoteke sa skicom
vi: Nâng cấp các tập tin bản thảo sang định dạng mới khi lưu (.pde -> .ino)

source: Automatically associate .ino files with Arduino
hr: Automatski poveži .ino datoteke s Arduino IDE-om
vi: Tự động liên kết tập tin .ino với Arduino

source: More preferences can be edited directly in the file
hr: Ostale postavke moguće je uređivati direktno u datoteci
vi: Thêm nhiều tùy chỉnh có thể chỉnh trực tiếp ngay trong tập tin

source: (edit only when Arduino is not running)
hr: (uređuj samo kada Arduino ne radi)
vi: (chỉ chỉnh sửa khi Arduino không chạy)

source: ignoring invalid font size {0}
hr: ignoriraj pogrešnu veličinu fonta {0}
vi: bỏ qua cỡ chữ không đúng {0}

source: As of Arduino 1.0, the Udp class in the Ethernet library has been renamed to EthernetClient.
hr: Od Arduino 1.0, Udp klasa u Ethernet biblioteci je preimenovana u EthernetUdp.
